[Survived] BooleanLiteral
app/pages/user-details/user-details-page.component.ts:19:26
   user: UserInterface | null = null;
 
   get isNotFound(): boolean {
-    return !this.user && !this.loading;
+    return !this.user && this.loading;
   }
 

[Survived] ConditionalExpression
app/pages/user-details/user-details-page.component.ts:19:12
   user: UserInterface | null = null;
 
   get isNotFound(): boolean {
-    return !this.user && !this.loading;
+    return true;
   }
 

[Survived] BooleanLiteral
app/pages/user-details/user-details-page.component.ts:22:22
     return !this.user && !this.loading;
   }
 
-  loading: boolean = false;
+  loading: boolean = true;
 
   subscription: Subscription | null = null;

[Killed] BlockStatement
app/pages/user-details/user-details-page.component.ts:36:20
     private service: UsersService
   ) {}
 
-  ngOnInit(): void {
-    const id = this.activeRoute.snapshot.params['id'];
-    this.getUserWithId(id);
-  }
+  ngOnInit(): void {}
 
   private getUserWithId(id: string): void {
killedBy: UserDetailsPage.Component ngOnInit should get the user without data
statusReason: Expected spy getUserById to have been called with:
  [ 'no_exist' ]
but it was never called.

[Killed] BlockStatement
app/pages/user-details/user-details-page.component.ts:41:43
     this.getUserWithId(id);
   }
 
-  private getUserWithId(id: string): void {
-    if (id) {
-      this.loading = true;
-      this.subscription = this.service.getUserById(id).subscribe((resp) => {
-        this.loading = false;
-        if (resp.login !== '') {
-          this.user = resp;
-        }
-      });
-    }
-  }
+  private getUserWithId(id: string): void {}
 
   ngOnDestroy(): void {
killedBy: UserDetailsPage.Component ngOnInit should get the user without data
statusReason: Expected spy getUserById to have been called with:
  [ 'no_exist' ]
but it was never called.

[Killed] ConditionalExpression
app/pages/user-details/user-details-page.component.ts:42:9
   }
 
   private getUserWithId(id: string): void {
-    if (id) {
+    if (true) {
       this.loading = true;
       this.subscription = this.service.getUserById(id).subscribe((resp) => {
killedBy: UserDetailsPage.Component ngOnInit should not change user=null if id is not defined
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
app/pages/user-details/user-details-page.component.ts:42:13
   }
 
   private getUserWithId(id: string): void {
-    if (id) {
-      this.loading = true;
-      this.subscription = this.service.getUserById(id).subscribe((resp) => {
-        this.loading = false;
-        if (resp.login !== '') {
-          this.user = resp;
-        }
-      });
-    }
+    if (id) {}
   }
 
killedBy: UserDetailsPage.Component ngOnInit should get the user without data
statusReason: Expected spy getUserById to have been called with:
  [ 'no_exist' ]
but it was never called.

[Survived] BooleanLiteral
app/pages/user-details/user-details-page.component.ts:43:22
 
   private getUserWithId(id: string): void {
     if (id) {
-      this.loading = true;
+      this.loading = false;
       this.subscription = this.service.getUserById(id).subscribe((resp) => {
         this.loading = false;

[Killed] BlockStatement
app/pages/user-details/user-details-page.component.ts:44:76
   private getUserWithId(id: string): void {
     if (id) {
       this.loading = true;
-      this.subscription = this.service.getUserById(id).subscribe((resp) => {
-        this.loading = false;
-        if (resp.login !== '') {
-          this.user = resp;
-        }
-      });
+      this.subscription = this.service.getUserById(id).subscribe((resp) => {});
     }
   }
killedBy: UserDetailsPage.Component ngOnInit should get the user with id=usuario1
statusReason: Expected null to equal Object({ login: 'usuario1', id: '1', name: 'Nombre Usuario' }).

[Survived] BooleanLiteral
app/pages/user-details/user-details-page.component.ts:45:24
     if (id) {
       this.loading = true;
       this.subscription = this.service.getUserById(id).subscribe((resp) => {
-        this.loading = false;
+        this.loading = true;
         if (resp.login !== '') {
           this.user = resp;

[Killed] ConditionalExpression
app/pages/user-details/user-details-page.component.ts:46:13
       this.loading = true;
       this.subscription = this.service.getUserById(id).subscribe((resp) => {
         this.loading = false;
-        if (resp.login !== '') {
+        if (true) {
           this.user = resp;
         }
killedBy: UserDetailsPage.Component ngOnInit should get the user without data
statusReason: Expected Object({ login: '', name: '', id: '' }) to equal null.

[Killed] EqualityOperator
app/pages/user-details/user-details-page.component.ts:46:13
       this.loading = true;
       this.subscription = this.service.getUserById(id).subscribe((resp) => {
         this.loading = false;
-        if (resp.login !== '') {
+        if (resp.login === '') {
           this.user = resp;
         }
killedBy: UserDetailsPage.Component ngOnInit should get the user without data
statusReason: Expected Object({ login: '', name: '', id: '' }) to equal null.

[Survived] BlockStatement
app/pages/user-details/user-details-page.component.ts:53:23
     }
   }
 
-  ngOnDestroy(): void {
-    this.subscription?.unsubscribe();
-  }
+  ngOnDestroy(): void {}
 }
 
