[Killed] BlockStatement
app/pages/users/users-page.component.ts:34:20
    */
   constructor(private router: Router, private service: UsersService) {}
 
-  ngOnInit(): void {
-    this.subscription = this.service
-      .getUsers()
-      .pipe(take(1))
-      .subscribe((users) => {
-        this.usersList = users;
-      });
-  }
+  ngOnInit(): void {}
 
   navigateTo(url: string, id: string) {
killedBy: UsersPageComponent ngOnInit should set usersList with service response
statusReason: Expected $.length = 0 to equal 2.
Expected $[0] = undefined to equal Object({ login: 'usuario1', id: '1', name: 'Nombre usuario 1' }).
Expected $[1] = undefined to equal Object({ login: 'usuario2', id: '2', name: 'Nombre usuario 2' }).

[Killed] BlockStatement
app/pages/users/users-page.component.ts:38:29
     this.subscription = this.service
       .getUsers()
       .pipe(take(1))
-      .subscribe((users) => {
-        this.usersList = users;
-      });
+      .subscribe((users) => {});
   }
 
killedBy: UsersPageComponent ngOnInit should set usersList with service response
statusReason: Expected $.length = 0 to equal 2.
Expected $[0] = undefined to equal Object({ login: 'usuario1', id: '1', name: 'Nombre usuario 1' }).
Expected $[1] = undefined to equal Object({ login: 'usuario2', id: '2', name: 'Nombre usuario 2' }).

[Killed] BlockStatement
app/pages/users/users-page.component.ts:43:39
       });
   }
 
-  navigateTo(url: string, id: string) {
-    this.router.navigate([`${url}/${id}`]);
-  }
+  navigateTo(url: string, id: string) {}
 
   trackByFn(_index: number, item: UserInterface): string {
killedBy: UsersPageComponent navigateTo should call routing service with correct params
statusReason: Expected spy navigate to have been called with:
  [ [ 'user-details/loginName' ] ]
but it was never called.
