[Killed] StringLiteral
src/app/services/users.service.ts:15:47
 })
 export class UsersService {
   private baseUrl: string = 'https://api.github.com';
-  private emptyUser: UserInterface = { login: '', id: '', name: '' };
+  private emptyUser: UserInterface = { login: "Stryker was here!", id: '', name: '' };
 
   /**
killedBy: UsersService getUserById should catchError for wrong request
statusReason: Expected $.login = 'Stryker was here!' to equal ''.
